<?php

//- 3 task найти в массиве число второе по величине

//- 6 task in_array - Проверяет, присутствует ли в массиве значение (своя реализация функции php)


//- 7 task array_diff - Вычислить расхождение массивов (своя реализация функции php)


//- 8 task sort  - Сортирует массив (своя реализация функции php)


//- 9 task strpos  - Возвращает позицию первого вхождения подстроки (своя реализация функции php)


//- 10 task substr - Возвращает подстроку (своя реализация функции php)


//- 11 task substr_count - Возвращает число вхождений подстроки (своя реализация функции php)


//- 12 task explode - Возвращает число вхождений подстроки (своя реализация функции php)


?>